kosovo-1/app/controllers/reviews_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    @post = Post.find params[:post_id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("post_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["post_id", 1], ["created_at", "2019-07-09 23:08:40.303163"], ["updated_at", "2019-07-09 23:08:40.303163"]]
INSERT INTO "reviews" ("post_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["post_id", 1], ["created_at", "2019-07-09 22:41:07.916045"], ["updated_at", "2019-07-09 22:41:07.916045"]]
---
  def create
    @user = current_user
    @post = Post.find params[:post_id]
    @review = @post.reviews.merge(current_user.reviews).create review_params
    if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."post_id" = $1  [["post_id", 1]]
---
  def set_review
    @post = Post.find params[:post_id]
      @reviews = @post.reviews
      @review = @reviews.find params[:id]